ahtn/keyplus/efm8/efm8/mcu/EFM8SB2/peripheral_driver/inc/spi_1.h
/******************************************************************************
 * Copyright (c) 2015 by Silicon Laboratories Inc. All rights reserved.
 *
 * http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
 *****************************************************************************/

#ifndef __SPI_1_H__
#define __SPI_1_H__

#include "efm8_config.h"
#include "SI_EFM8SB2_Register_Enums.h"

/**************************************************************************//**
 *
 * @addtogroup spi_1_group SPI1 Driver
 * @{
 *
 * @brief Peripheral driver for SPI 1
 *
 * # Introduction #
 *
 * @note This driver is the same as the SPI0 peripheral driver, except that
 * SPI0 is replaced by SPI1.  All of the functions work in the same way.
 *
 * This module provides an API for using the SPI1 peripheral.  There is a
 * basic API to provide simple access to the SPI features, and a more advanced
 * buffered API that provides interrupt based transfers.  The user can also
 * choose to configure the SPI peripheral at run-time using the initialization
 * API or to bypass the initialization API and configure the peripheral during
 * a central system initialization function.
 *
 * ## Multibyte Transfers ##
 *
 * There are two methods of performing multibyte transfers, using a polling
 * (blocking) method or an interrupt (non-blocking) method.  The setup and
 * function call signature is the same for both.  In each case the caller
 * provides buffers for transmit and receive data.  The transmit data buffer
 * must be pre-filled with the data to be sent, while the receive buffer will
 * be filled with received data bytes.  The caller must provide pointers to
 * buffers of sufficient size to complete the transfer.
 *
 * If you want to only perform a transfer in one direction, then you can supply
 * a NULL pointer for the unused buffer.  For transmit-only transfers, all
 * received bytes are discarded.  For receive-only transfers, zero bytes will
 * be transmitted.
 *
 * For bidirectional transfers, the same number of bytes are transmitted and
 * received.  For a transfer where the number of transmitted and received bytes
 * are not the same, you must chain together transfers as needed to get the
 * number of bytes needed in each direction.
 *
 * ## Chip Select ##
 *
 * The SPI interface can be used in 3-wire or 4-wire mode.  If 3-wire mode
 * is used, then the SPI interface can be used with no chip select, or the
 * application can use a separate GPIO for the chip select.  For example, if
 * a SPI master needs to control several SPI slaves, then you would choose
 * 3-wire mode, and use a separate GPIO as the chip select for each SPI
 * slave.  In this case, the application must control the GPIO as chip select,
 * asserting it before starting a transfer and de-asserting when the transfer
 * is complete.
 *
 * If 4-wire mode is used, then the chip select is managed by the driver and
 * the peripheral.  When a SPI master, the chip select signal (NSS) will be
 * asserted automatically at the start of the transfer and de-asserted when
 * complete.  If a SPI slave, then the NSS signal is monitored and used to
 * gate SPI transfers.
 *
 *****************************************************************************/

// The following section is used to document configuration options

/**************************************************************************//**
 * @addtogroup spi1_config SPI Driver Configuration
 * @{
 *
 * @brief Driver configuration constants read from efm8_config.h
 *
 * This peripheral driver will look for configuration constants in
 * **efm8_config.h**. This file is provided/written by the user and should be
 * located in a directory that is part of the include path.
 *
 *****************************************************************************/

/**************************************************************************//**
 * @def EFM8PDL_SPI1_USE_BUFFER
 * @brief Controls inclusion of SPI1 Buffer Access API.
 *
 * The Buffer Access API includes code in the SPI driver to buffer incoming
 * and outgoing SPI data including an interrupt handler that makes callbacks.
 * When set to '1' the SPI1 Buffered Access API is included in the driver.
 *
 * @note When this feature is enabled, a SPI1 interrupt handler will be
 * included in the driver.  If you want to manage SPI interrupts with
 * application code, then this option should be disabled.
 *
 * The default setting is '0' and may be overridden by defining the value
 * in 'efm8_config.h'.
 *****************************************************************************/

/**************************************************************************//**
 * @def EFM8PDL_SPI1_USE_ERR_CALLBACK
 * @brief Controls whether buffered API uses an error callback function.
 *
 * This option is only meaningful if @ref EFM8PDL_SPI1_USE_BUFFER is enabled.
 * If this option is enabled, when an error is detected in the SPI interrupt
 * handler, the callback function SPI1_transferErrorCallback() will be called.
 * If this option is not enabled, then the error callback will not be called
 * and it does not need to be provided by the application.
 *
 * @note This feature is only useful if the SPI peripheral is to be used
 * in slave mode.
 *
 * The default setting is '0' and may be overridden by defining the value
 * in 'efm8_config.h'.
 *****************************************************************************/

/**************************************************************************//**
 * @def EFM8PDL_SPI1_USE_PIPELINE
 * @brief Controls buffered mode data pipelining.
 *
 * When using a buffered transfer with SPI1_transfer() the data can be
 * pipelined such that the driver attempts to keep the transmit buffer as
 * full as possible.  This will use the full bandwidth of the hardware
 * peripheral, but can cause data loss if system interrupt latency is too
 * high.  The SPI interrupt must be serviced within 2 byte-times or received
 * data can be lost.  If this feature is disabled, then writes and reads
 * will be matched to ensure that no receive data is lost.  However then
 * there can be irregular timing gaps between bytes and the full bandwidth
 * of the SPI bus is not used.
 *
 * @note This applies to master mode.  If you intend to use slave mode,
 * then this feature must be turned on.
 *
 * If you are using slave mode then this feature should be enabled.  If you
 * are only using master mode then you can leave this disabled if you are
 * concerned about interrupt latency in your system and SPI bus performance
 * is not important.  You can enable this if the interrupt latency in your
 * system is not too high, or if the SPI interrupt priority is set high
 * enough that it cannot miss SPI interrupts.
 *
 * The default setting is '0' and may be overridden by defining the value
 * in 'efm8_config.h'.
 *****************************************************************************/

/**************************************************************************//**
 * @def EFM8PDL_SPI1_AUTO_PAGE
 * @brief Provides automatic SFR paging and restoring.
 *
 * If this setting is '1' then the SPI driver will not assume the SFR page
 * and will explicitly set and restore the SFR page whenever it accesses
 * an SFR.  This will add more code and processing time to the SPI driver
 * functions.  If your code ensures that the SFRPAGE remains at 0 by default
 * whenever calling SPI functions, then this setting can be turned off which
 * will save code and improve performance.
 *
 * The default setting is '1' and may be overridden by defining the value
 * in 'efm8_config.h'.
 *****************************************************************************/

/**************************************************************************//**
 * @def EFM8PDL_SPI1_RX_SEGTYPE
 * @brief Controls the type of pointer used for receive buffers.
 *
 * Sets the memory segment type for the receive buffer pointer when using
 * SPI1_pollTransfer() or SPI1_transfer().  Valid values are:
 *
 * - SI_SEG_XDATA (default)
 * - SI_SEG_PDATA
 * - SI_SEG_IDATA
 * - SI_SEG_CODE
 * - SI_SEG_GENERIC
 *
 * @warning Use of generic pointers will increase the code size and reduce
 * performance of buffering functions.  The specific memory segment should
 * always be specified if possible.
 *****************************************************************************/

/**************************************************************************//**
 * @def EFM8PDL_SPI1_TX_SEGTYPE
 * @brief Controls the type of pointer used for transmit buffers.
 *
 * Sets the memory segment type for the transmit buffer pointer when using
 * SPI1_pollTransfer() or SPI1_transfer().  Valid values are:
 *
 * - SI_SEG_XDATA (default)
 * - SI_SEG_PDATA
 * - SI_SEG_IDATA
 * - SI_SEG_CODE
 * - SI_SEG_GENERIC
 *****************************************************************************/

/**  @} (end addtogroup spi1_config */

